swarnmani/fmtr/arm_cortex/LPC111x_Lib/source/lpc11xx_uart.c
/***********************************************************************//**
 * @file	: lpc11xx_uart.c
 * @brief	: Contains all functions support for UART firmware library on LPC11xx
 * @version	: 1.0
 * @date	: 22. Jan. 2010
 * @author	: Coocox
 **********************************************************************/

/* Peripheral group ----------------------------------------------------------- */
/** @addtogroup UART
 * @{
 */

/* Includes ------------------------------------------------------------------- */
#include "lpc11xx_uart.h"
#include "lpc11xx_syscon.h"
#include "lpc11xx_iocon.h"
#include "lpc11xx_libcfg.h"


#if _UART

/* Private Types -------------------------------------------------------------- */
/** @defgroup UART_Private_Types
 * @{
 */

/**
 * @brief UART call-back function type definitions
 */
typedef struct {
	fnTxCbs_Type *pfnTxCbs; 	// Transmit callback
	fnRxCbs_Type *pfnRxCbs;		// Receive callback
	fnABCbs_Type *pfnABCbs;		// Auto-Baudrate callback
	fnErrCbs_Type *pfnErrCbs;	// Error callback
} UART_CBS_Type;

/**
 * @}
 */


/* Private Variables ---------------------------------------------------------- */
/** @defgroup UART_Private_Variables
 * @{
 */


/** Call-back function pointer data */
UART_CBS_Type uartCbsDat[4] = {
		{NULL, NULL, NULL, NULL},
		{NULL, NULL, NULL, NULL},
		{NULL, NULL, NULL, NULL},
		{NULL, NULL, NULL, NULL},
};

/** UART modem status interrupt callback pointer data */
fnModemCbs_Type *pfnModemCbs = NULL;

/**
 * @}
 */


/* Private Functions ---------------------------------------------------------- */
/** @defgroup UART_Private_Functions
 * @{
 */

/**
 * @brief		Get UART number due to UART peripheral pointer
 * @param[in]	UARTx	UART pointer
 * @return		UART number
 */
uint8_t getUartNum(UART_TypeDef *UARTx) {
	if (UARTx == LPC_UART) return (0);	
	else return (0);
}

/*********************************************************************//**
 * @brief		Determines best dividers to get a target clock rate
 * @param[in]	UARTx	Pointer to selected UART peripheral, should be
 * 						UART0, UART, UART2 or UART3.
 * @param[in]	baudrate Desired UART baud rate.
 * @return 		Error status.
 **********************************************************************/

Status uart_set_divisors(UART_TypeDef *UARTx, uint32_t baudrate)
{
	Status errorStatus = ERROR;

	uint32_t uClk;
	uint32_t calcBaudrate = 0;
	uint32_t temp = 0;

	uint32_t mulFracDiv, dividerAddFracDiv;
	uint32_t diviser = 0 ;
	uint32_t mulFracDivOptimal = 1;
	uint32_t dividerAddOptimal = 0;
	uint32_t diviserOptimal = 0;

	uint32_t relativeError = 0;
	uint32_t relativeOptimalError = 100000;

	/* get UART block clock */
	uClk = SYSCON_GetUARTClock();
	
	uClk = uClk >> 4; /* div by 16 */
	/* In the Uart IP block, baud rate is calculated using FDR and DLL-DLM registers
	* The formula is :
	* BaudRate= uClk * (mulFracDiv/(mulFracDiv+dividerAddFracDiv) / (16 * (DLL)
	* It involves floating point calculations. That's the reason the formulae are adjusted with
	* Multiply and divide method.*/
	/* The value of mulFracDiv and dividerAddFracDiv should comply to the following expressions:
	* 0 < mulFracDiv <= 15, 0 <= dividerAddFracDiv <= 15 */
	for (mulFracDiv = 1 ; mulFracDiv <= 15 ;mulFracDiv++)
	{
	for (dividerAddFracDiv = 0 ; dividerAddFracDiv <= 15 ;dividerAddFracDiv++)
	{
	  temp = (mulFracDiv * uClk) / ((mulFracDiv + dividerAddFracDiv));

	  diviser = temp / baudrate;
	  if ((temp % baudrate) > (baudrate / 2))
		diviser++;

	  if (diviser > 2 && diviser < 65536)
	  {
		calcBaudrate = temp / diviser;

		if (calcBaudrate <= baudrate)
		  relativeError = baudrate - calcBaudrate;
		else
		  relativeError = calcBaudrate - baudrate;

		if ((relativeError < relativeOptimalError))
		{
		  mulFracDivOptimal = mulFracDiv ;
		  dividerAddOptimal = dividerAddFracDiv;
		  diviserOptimal = diviser;
		  relativeOptimalError = relativeError;
		  if (relativeError == 0)
			break;
		}
	  } /* End of if */
	} /* end of inner for loop */
	if (relativeError == 0)
	  break;
	} /* end of outer for loop  */

	if (relativeOptimalError < ((baudrate * UART_ACCEPTED_BAUDRATE_ERROR)/100))
	{
    	((UART_TypeDef *)UARTx)->LCR |= UART_LCR_DLAB_EN;
    	((UART_TypeDef *)UARTx)->DLM = UART_LOAD_DLM(diviserOptimal);
    	((UART_TypeDef *)UARTx)->DLL = UART_LOAD_DLL(diviserOptimal);
    	/* Then reset DLAB bit */
    	((UART_TypeDef *)UARTx)->LCR &= (~UART_LCR_DLAB_EN) & UART_LCR_BITMASK;
    	((UART_TypeDef *)UARTx)->FDR = (UART_FDR_MULVAL(mulFracDivOptimal) \
    			| UART_FDR_DIVADDVAL(dividerAddOptimal)) & UART_FDR_BITMASK;	
    }
	return errorStatus;
}

/*********************************************************************//**
 * @brief		General UART interrupt handler and router
 * @param[in]	UARTx	Selected UART peripheral, should be UART0..3
 * @return		None
 *
 * Note:
 * - Handles transmit, receive, and status interrupts for the UART.
 * Based on the interrupt status, routes the interrupt to the
 * respective call-back to be handled by the user application using
 * this driver.
 * - If callback is not installed, corresponding interrupt will be disabled
 * - All these interrupt source below will be checked:
 *   		- Transmit Holding Register Empty.
 * 			- Received Data Available and Character Time Out.
 * 			- Receive Line Status (not implemented)
 * 			- End of auto-baud interrupt (not implemented)
 * 			- Auto-Baudrate Time-Out interrupt (not implemented)
 * 			- Modem Status interrupt (UART0 Modem functionality)
 * 			- CTS signal transition interrupt (UART0 Modem functionality)
 **********************************************************************/
void UART_GenIntHandler(UART_TypeDef *UARTx)
{
	uint8_t pUart, modemsts;
	uint32_t intsrc, tmp, tmp1;

	pUart = getUartNum(UARTx);

	/* Determine the interrupt source */
	intsrc = UARTx->IIR;
	tmp = intsrc & UART_IIR_INTID_MASK;

	/*
	 * In case of using UART with full modem,
	 * interrupt ID = 0 that means modem status interrupt has been detected
	 */	
	if (tmp == 0){
		// Check Modem status
		modemsts = UARTx->MSR & UART_MSR_BITMASK;
		// Call modem status call-back
		if (pfnModemCbs != NULL){
			pfnModemCbs(modemsts);
		}
		// disable modem status interrupt and CTS status change interrupt
		// if its callback is not installed
		//else {
		//	UARTx->IER &= ~(UART_IER_MSINT_EN | UART_IER_CTSINT_EN);
		//}
	}

	// Receive Line Status
	if (tmp == UART_IIR_INTID_RLS){
		// Check line status
		tmp1 = UARTx->LSR;
		// Mask out the Receive Ready and Transmit Holding empty status
		tmp1 &= (UART_LSR_OE | UART_LSR_PE | UART_LSR_FE \
				| UART_LSR_BI | UART_LSR_RXFE);
		// If any error exist
		if (tmp1) {
			// Call Call-back function with error input value
			if (uartCbsDat[pUart].pfnErrCbs != NULL) {
				uartCbsDat[pUart].pfnErrCbs(tmp1);
			}
			// Disable interrupt if its call-back is not install
			else {
				UARTx->IER &= ~(UART_IER_RLSINT_EN);
			}
		}
	}

	// Receive Data Available or Character time-out
	if ((tmp == UART_IIR_INTID_RDA) || (tmp == UART_IIR_INTID_CTI)){
		// Call Rx call back function
		if (uartCbsDat[pUart].pfnRxCbs != NULL) {
			uartCbsDat[pUart].pfnRxCbs();
		}
		// Disable interrupt if its call-back is not install
		else {
			UARTx->IER &= ~(UART_IER_RBRINT_EN);
		}
	}

