swarnmani/fmtr/arm_cortex/LPC111x_Lib/source/lpc11xx_uart.c
	// Transmit Holding Empty
	if (tmp == UART_IIR_INTID_THRE){
		// Call Tx call back function
		if (uartCbsDat[pUart].pfnTxCbs != NULL) {
			uartCbsDat[pUart].pfnTxCbs();
		}
		// Disable interrupt if its call-back is not install
		else {
			UARTx->IER &= ~(UART_IER_THREINT_EN);
		}
	}

	intsrc &= (UART_IIR_ABEO_INT | UART_IIR_ABTO_INT);
	// Check if End of auto-baudrate interrupt or Auto baudrate time out
	if (intsrc){
		// Clear interrupt pending
		UARTx->ACR |= ((intsrc & UART_IIR_ABEO_INT) ? UART_ACR_ABEOINT_CLR : 0) \
						| ((intsrc & UART_IIR_ABTO_INT) ? UART_ACR_ABTOINT_CLR : 0);
		if (uartCbsDat[pUart].pfnABCbs != NULL) {
			uartCbsDat[pUart].pfnABCbs(intsrc);
		} else {
			// Disable End of AB interrupt
			UARTx->IER &= ~(UART_IER_ABEOINT_EN | UART_IER_ABTOINT_EN);
		}
	}
}

/**
 * @}
 */


/* Public Functions ----------------------------------------------------------- */
/** @addtogroup UART_Public_Functions
 * @{
 */

/*********************************************************************//**
 * @brief		De-initializes the UARTx peripheral registers to their
*                  default reset values.
 * @param[in]	UARTx	UART peripheral selected, should be UART0, UART,
 * 						UART2 or UART3.
 * @return 		None
 **********************************************************************/
void UART_DeInit(UART_TypeDef* UARTx)
{
	// For debug mode
	CHECK_PARAM(PARAM_UARTx(UARTx));

	UART_TxCmd(UARTx, DISABLE);

	/* Set up clock and power for UART module */
	SYSCON_AHBPeriphClockCmd (SYSCON_AHBPeriph_UART, DISABLE);
}

/********************************************************************//**
 * @brief 		Init UART pins, pins assign:
 *                UART RXD - PIO1_6
 *                UART TXD - PIO1_7 
 *
 * @return		None
 *********************************************************************/
void UART_PinsInit(void)
{
    IOCON_SetPinFunc(IOCON_PIO1_6, PIO1_6_FUN_RXD);   /* UART RXD - PIO1_6 */
    IOCON_SetPinFunc(IOCON_PIO1_7, PIO1_7_FUN_TXD);   /* UART RXD - PIO1_7 */    
}

/********************************************************************//**
 * @brief 		Init UART mode pins, pins assign:
 *                UART DTR - PIO2_0
 *                UART CTS - PIO0_7
 *                UART RTS - PIO1_5
 *                UART DSR - PIO2_1
 *                UART DCD - PIO2_2
 *                UART RI  - PIO2_3
 *
 * @return		None
 *********************************************************************/
void UART_ModePinsInit(void)
{
    IOCON_SetPinFunc(IOCON_PIO2_0, PIO2_0_FUN_DTR);   /* UART DTR - PIO2_0 */
    IOCON_SetPinFunc(IOCON_PIO0_7, PIO0_7_FUN_CTS);   /* UART CTS - PIO0_7 */
    IOCON_SetPinFunc(IOCON_PIO1_5, PIO1_5_FUN_RTS);   /* UART RTS - PIO1_5 */
    
    /* DSR_PIO2_1  */     
    /* DSR_PIO3_1  */
    IOCON_DSRLocate(DSR_PIO2_1);                      
    IOCON_SetPinFunc(IOCON_PIO2_1, PIO2_1_FUN_DSR);   /* UART DSR - PIO2_1 */

    //IOCON_DSRLocate(DSR_PIO3_1);                      
    //IOCON_SetPinFunc(IOCON_PIO3_1, PIO3_1_FUN_DSR);  
    
    /* DCD_PIO2_2 */
    /* DCD_PIO3_2 */
    IOCON_DCDLocate(DCD_PIO2_2);
    IOCON_SetPinFunc(IOCON_PIO2_2, PIO2_2_FUN_DCD);   /* UART DCD - PIO2_2 */

    //IOCON_DCDLocate(DCD_PIO3_2);
    //IOCON_SetPinFunc(IOCON_PIO3_2, PIO2_3_FUN_DCD);

    /* RI_PIO2_3 */
    /* RI_PIO3_3 */
    IOCON_RILocate(RI_PIO2_3);
    IOCON_SetPinFunc(IOCON_PIO2_3, PIO2_3_FUN_RI);    /* UART RI - PIO2_3 */

    //IOCON_RILocate(RI_PIO3_3);
    //IOCON_SetPinFunc(IOCON_PIO3_3, PIO3_3_FUN_RI);
}


/********************************************************************//**
 * @brief		Initializes the UARTx peripheral according to the specified
 *               parameters in the UART_ConfigStruct. 
 * @param[in]	UARTx	UART peripheral selected, should be UART0, UART,
 * 						UART2 or UART3.
 * @param[in]	UART_ConfigStruct Pointer to a UART_CFG_Type structure
*                    that contains the configuration information for the
*                    specified UART peripheral.
 * @return 		None
 *********************************************************************/
void UART_Init(UART_TypeDef *UARTx, UART_CFG_Type *UART_ConfigStruct)
{
	uint32_t tmp;

	// For debug mode
	CHECK_PARAM(PARAM_UARTx(UARTx));
	CHECK_PARAM(PARAM_UART_DATABIT(UART_ConfigStruct->Databits));
	CHECK_PARAM(PARAM_UART_STOPBIT(UART_ConfigStruct->Stopbits));
	CHECK_PARAM(PARAM_UART_PARITY(UART_ConfigStruct->Parity));

	/* Set up clock and power for UART module */
	SYSCON_AHBPeriphClockCmd (SYSCON_AHBPeriph_UART, ENABLE);

    // If UART_PCLK is shut down, start it
    if (SYSCON_GetUARTClockDiv() == 0) {
        SYSCON_SetUARTClockDiv(1);
    }    

	/* FIFOs are empty */
	((UART_TypeDef *)UARTx)->FCR = ( UART_FCR_FIFO_EN \
			| UART_FCR_RX_RS | UART_FCR_TX_RS);
	// Disable FIFO
	((UART_TypeDef *)UARTx)->FCR = 0;

	// Dummy reading
	while (((UART_TypeDef *)UARTx)->LSR & UART_LSR_RDR)
	{
		tmp = ((UART_TypeDef *)UARTx)->RBR;
	}

	((UART_TypeDef *)UARTx)->TER = UART_TER_TXEN;
	// Wait for current transmit complete
	while (!(((UART_TypeDef *)UARTx)->LSR & UART_LSR_THRE));
	// Disable Tx
	((UART_TypeDef *)UARTx)->TER = 0;

	// Disable interrupt
	((UART_TypeDef *)UARTx)->IER = 0;
	// Set LCR to default state
	((UART_TypeDef *)UARTx)->LCR = 0;
	// Set ACR to default state
	((UART_TypeDef *)UARTx)->ACR = 0;
	// Set Modem Control to default state
	((UART_TypeDef *)UARTx)->MCR = 0;
	// Set RS485 control to default state
	((UART_TypeDef *)UARTx)->RS485CTRL = 0;
	// Set RS485 delay timer to default state
	((UART_TypeDef *)UARTx)->RS485DLY = 0;
	// Set RS485 addr match to default state
	((UART_TypeDef *)UARTx)->ADRMATCH = 0;
	//Dummy Reading to Clear Status
	tmp = ((UART_TypeDef *)UARTx)->MSR;
	tmp = ((UART_TypeDef *)UARTx)->LSR;
		
	// Set Line Control register ----------------------------

	uart_set_divisors(UARTx, (UART_ConfigStruct->Baud_rate));

	tmp = (((UART_TypeDef *)UARTx)->LCR & (UART_LCR_DLAB_EN | UART_LCR_BREAK_EN)) \
			& UART_LCR_BITMASK;
	
	switch (UART_ConfigStruct->Databits){
	case UART_DATABIT_5:
		tmp |= UART_LCR_WLEN5;
		break;
	case UART_DATABIT_6:
		tmp |= UART_LCR_WLEN6;
		break;
	case UART_DATABIT_7:
		tmp |= UART_LCR_WLEN7;
		break;
	case UART_DATABIT_8:
	default:
		tmp |= UART_LCR_WLEN8;
		break;
	}

